"""
有如下员工信息，请使用字典完成数据的记录。
并通过for循环，对所有级别为1级的员工，级别上升1级，薪水增加1000元
"""
obj = {
    'wlh':{
        '部门': '科技部',
        '工资': 3000,
        '级别': 1,
    },
    'zjl':{
        '部门': '市场部',
        '工资': 5000,
        '级别': 2,
    },
    'ljj':{
        '部门': '市场部',
        '工资': 7000,
        '级别': 1,
    },
    'zxy':{
        '部门': '科技部',
        '工资': 4000,
        '级别': 1,
    },
    'ldh':{
        '部门': '市场部',
        '工资': 6000,
        '级别': 2,
    }
}

print(obj)

for item in obj.keys():
    if obj[item]['级别'] == 1 :
        obj[item]['工资'] += 1000

print(obj)